In [2]:
import pandas as pd
import sqlite3

In [3]:
connection = sqlite3.connect(":memory:")

monuments_df = pd.read_excel('Hanson2016_CitiesDatabase_OxREP.xlsx', sheet_name='monuments')

monuments_df.to_sql('monuments', con = connection, index = False)

monuments_df

                   id           structure
0        Hanson2016_1           Acropolis
1        Hanson2016_1               Agora
2        Hanson2016_1    Temple of Apollo
3        Hanson2016_1             Theatre
4        Hanson2016_1               Walls
...               ...                 ...
9467  Hanson2016_1388  Temple of Dionysus
9468  Hanson2016_1388          Urban grid
9469  Hanson2016_1388               Walls
9470   Hanson2016_167             Theatre
9471   Hanson2016_669             Theatre

[9472 rows x 2 columns]

In [4]:
cities_df = pd.read_excel('Hanson2016_CitiesDatabase_OxREP.xlsx', sheet_name='cities')

cities_df.to_sql('cities', con = connection, index = False)

cities_df

,id,ancient_toponym,modern_toponym,province,country,barrington_atlas_rank,barrington_atlas_reference,start_date,end_date,longitude,latitude,select_bibliography
0,Hanson2016_1,Abae,Kalapodi,Achaea,Greece,4 or 5,55 D3,-600,NaN,22.933333,38.583333,BNP; Hansen 2006; Hansen and Nielsen 2004; PEC...
1,Hanson2016_2,Acharnae,Acharnes,Achaea,Greece,3,59 B2,-600,NaN,23.734088,38.083473,BNP; DGRG; PECS; Sear 2006.
2,Hanson2016_3,Acraephia,Akraifnio,Achaea,Greece,3,55 E4,-600,NaN,23.219702,38.452606,BNP; DGRG; Hansen and Nielsen 2004; PECS; Sear...
3,Hanson2016_4,Aegina,Aigina,Achaea,Greece,2,59 A3,-600,NaN,23.428500,37.750074,BNP; DGRG; Hansen 2006; Hansen and Nielsen 200...
4,Hanson2016_5,Aegira,Aigeira,Achaea,Greece,3,58 C1,-600,NaN,22.355720,38.147951,DGRG; Hansen and Nielsen 2004.
...,...,...,...,...,...,...,...,...,...,...,...,...
1383,Hanson2016_1384,Pautalia,Kyustendi,Thracia,Bulgaria,3,49 E1,98,NaN,22.680752,42.282517,BNP; DGRG; Jones 1937; PECS; Wilkes 2003b.
1384,Hanson2016_1385,Philippopolis (Thracia),Plovdiv,Thracia,Bulgaria,2,22 B6,-342,NaN,24.750913,42.146652,BNP; Cohen 1995; DGRG; Hansen and Nielsen 2004...
1385,Hanson2016_1386,Samothrace,Samothrace,Thracia,Greece,3,51 F3,-700,NaN,25.529249,40.500693,BNP; Hansen 2006; Hansen and Nielsen 2004; PEC...
1386,Hanson2016_1387,Serdica,Sophia,Thracia,Bulgaria,2,21 F7,45,NaN,23.342891,42.722826,BNP; DGRG; Jones 1937; PECS; Sear 2006; Wilkes...
1387,Hanson2016_1388,Seuthopolis,Kazanlak,Thracia,Bulgaria,4 or 5,22 C6,-400,NaN,25.274047,42.628866,BNP; Cohen 1995; Hansen and Nielsen 2004; PECS...

### Create an ordered list with the city of each province with the most monuments, along with the counts of the monuments.

In [35]:
pd.read_sql("""
SELECT cities.province, COUNT(monuments.structure) AS monuments_count
FROM cities
LEFT JOIN monuments
ON cities.id = monuments.id

GROUP BY cities.province
ORDER BY monuments_count DESC

LIMIT 10
""", connection)

                         province  monuments_count
0                          Achaea             1094
1                            Asia              723
2  Italia (I Latium and Campania)              585
3            Italia (VII Etruria)              483
4              Lycia et Pamphylia              423
5            Africa Proconsularis              415
6              Gallia Narbonensis              315
7                         Numidia              295
8          Hispania Tarraconensis              267
9                         Silicia              258